In [26]:
from datafuzz.generators import DatasetGenerator
from datafuzz.parsers import SchemaYAMLParser

from random import randint

In [12]:
parser = SchemaYAMLParser('sales_with_customer.yaml')

In [13]:
parser.parse()

In [14]:
dg = DatasetGenerator(parser)

In [15]:
dg.generate()

In [19]:
sales_df = dg.to_output()

In [24]:
sales_df.head()

,associate,branch_id,coupon_code,customer_id,sale_amount,sale_number,timestamp
0,Christopher Vazquez,7,,89,1373.0,1884,2015-01-01T00:00:00
1,Chad Johnson,7,NEW20,155,-163.0,2114,2015-01-02T02:01:00
2,Marie Jones,1,,260,86.0,147,2015-01-04T11:01:49
3,Andre Wallace,9,PROMO15,60,801.0,2763,2015-01-05T17:01:56
4,Max Morgan,1,NEW20,81,372.0,597,2015-01-09T01:02:42

In [17]:
parser = SchemaYAMLParser('customer.yaml')

In [18]:
parser.parse()

In [20]:
dg = DatasetGenerator(parser)

In [21]:
dg.generate()

In [22]:
customer_df = dg.to_output()

In [23]:
customer_df.head()

,city,email,name,phone,timestamp
0,West Tina,mikayladuncan@moore-molina.com,Jose Shannon,+57(3)8752985788,2015-01-01T00:00:00
1,North Robert,grantsteven@gmail.com,Sarah Jones,886.954.7707x3298,2015-01-03T09:00:34
2,Moodybury,justin52@hotmail.com,Alexandria Nguyen,333-544-3676x55149,2015-01-05T15:01:36
3,Melissaborough,bentonandrew@nash.info,Jeffrey Wright,1-013-013-4606x938,2015-01-09T00:02:00
4,Susanfort,coryvargas@gmail.com,Cassandra David,221-419-9841,2015-01-11T08:03:01

In [28]:
def generate_email_from_name(row):
    if randint(0,10) < 5:
        ename = row['name'].split(' ')[1].lower().replace(' ', '')
    elif randint(0, 10) < 5:
        ename = row['name'].split(' ')[0].lower().replace(' ', '')
    else:
        ename = row['name'].lower().replace(' ', '.')
    
    if randint(0,10) >= 5:
        ename += str(randint(1980,2010))[:-2]
    
    return '{}@{}'.format(ename, row['email'].split('@')[1])

In [31]:
customer_df['new_email'] = customer_df.apply(generate_email_from_name, axis=1)

In [32]:
customer_df['email'] = customer_df['new_email']

In [37]:
customer_df = customer_df.drop('new_email', axis=1)

In [38]:
customer_df.head()

,city,email,name,phone,timestamp
0,West Tina,jose.shannon@moore-molina.com,Jose Shannon,+57(3)8752985788,2015-01-01T00:00:00
1,North Robert,jones19@gmail.com,Sarah Jones,886.954.7707x3298,2015-01-03T09:00:34
2,Moodybury,alexandria@hotmail.com,Alexandria Nguyen,333-544-3676x55149,2015-01-05T15:01:36
3,Melissaborough,jeffrey.wright@nash.info,Jeffrey Wright,1-013-013-4606x938,2015-01-09T00:02:00
4,Susanfort,david@gmail.com,Cassandra David,221-419-9841,2015-01-11T08:03:01

In [39]:
from sqlalchemy import create_engine

In [40]:
e = create_engine('sqlite:///sales.db')

In [42]:
sales_df.to_sql('sales', e)

In [43]:
customer_df.to_sql('customers', e)

In [ ]:
!sqlite3 sales.db '.tables'

In [ ]:
!sqlite3 sales.db 'select * from customers limit 2;'

In [ ]:
!sqlite3 sales.db 'select * from sales limit 2;'